#Напишите программу, которая выводит такое «окно» на экран.

#Первый вариант
# ==============================
# Привет
# друг
# ==============================

# Второй вариант
# ==============================
# ||        Привет            ||
# ||         друг             ||
# ==============================

#Третий вариант
# ==============================
# ||                          ||
# ||                          ||
# ||          Привет,         ||
# ||          друг!           ||
# ||                          ||
# ||                          ||
# ==============================

#Размер окна может быть любым, 
#вместо слова «друг» можете написать своё имя.
#Постарайтесь добиться результата из третьего варианта.
print('Задание 2.')

print('Первый вариант')
print('==============================')
print('Привет')
print('Роман')
print('==============================')
print('')
print('Второй вариант')
print('==============================')
print('||        Привет            ||')
print('||        Роман             ||')
print('==============================')
print('')
print('Третий вариант')
print(' ==============================')
print(' ||                          ||')
print(' ||                          ||')
print(' ||          Привет,         ||')
print(' ||          Роман!          ||')
print(' ||                          ||')
print(' ||                          ||')
print(' ==============================')